<a href="http://www.cear.ufpb.br/pet">
    <img src="../images/pandas_logo.png" width="180px" align="left">
</a>
<a href="http://www.cear.ufpb.br/pet">
    <img src="../images/logo_pet.png" width="150px" align="right">
</a>

<h1 align="center" style="color:blue" >Biblioteca Pandas em Python</h1>

<hr width="50%" align="center">

<h2 align="left" style="color:blue" >
    Essa biblioteca é a porta de entrada para os estudos que envolvem a Ciência de Dados. 
</h2>


<h3 align="left" style="color:blue" >
 Permite ler, manipular, agregar e plotar os dados em poucos passos.   
</h3>
<hr align="left" width="200px">

<h3 align="left" style="color:blue" >
    A biblioteca fornece duas maneiras de estruturar os nossos dados:
<h3>
<hr align="left" width="200px">

> O __DataFrame__ que possui uma estrutura tabular de N-dimensões, se assemelha a uma tabela no excel, onde seus itens são endereçados segundo linhas e colunas.

> A __Series__ que é uma matriz unidimensional que contém uma sequencia de valores acompanhado de seus respectivos índices.

Vamos observar cada uma delas.

<h3 align="left" style="color:blue" >
    Importando bibliotecas
<h3>
<hr align="left" width="200px">

In [1]:
import pandas as pd
import numpy as np

<h3 align="left" style="color:blue" >
   Criando series
<h3>
<hr align="left" width="200px">

In [2]:
np.arange(4)*10

array([ 0, 10, 20, 30])

In [4]:
labels = ["A","B","C","D"]
array = np.arange(4)*10
labels

['A', 'B', 'C', 'D']

In [5]:
pd.Series(data =array, index = labels )

A     0
B    10
C    20
D    30
dtype: int32

In [6]:
lista = ["Minicurso","Python","Online","Pandas"]
pd.Series(data =lista, index = labels )

A    Minicurso
B       Python
C       Online
D       Pandas
dtype: object

__Caso não declarado o indice é gerado automaticamente seguindo a ordem crescente__

In [7]:
pd.Series(data = lista)

0    Minicurso
1       Python
2       Online
3       Pandas
dtype: object

In [8]:
d = {"A":"Amor","B":"Baixinho"}
pd.Series(d)

A        Amor
B    Baixinho
dtype: object

In [10]:
pd.Series({"C":"caixa", "D":"dado"})

C    caixa
D     dado
dtype: object

__Uma series pode conter diferentes ditos de elementos__

In [11]:
Serie = pd.Series({"City":'João Pessoa',"Pop": 800.323,"Seadside": True})
Serie2 = pd.Series({"City":'Sousa',"Seadside": False,"Pop": 69.723})
print(Serie)
print( )
print(Serie2)

City        João Pessoa
Pop             800.323
Seadside           True
dtype: object

City         Sousa
Seadside     False
Pop         69.723
dtype: object

__Duas series soman-se indice a indice, mesmo que estejam desordenados__

In [12]:
Serie + Serie2

City        João PessoaSousa
Pop                  870.046
Seadside                   1
dtype: object

In [13]:
itens1 = pd.Series(data = [2,3,6,4], index = ["Arroz","Feijão","Queijo","Tapioca"])
itens2 = pd.Series(data = [9,1,7,3], index = ["Queijo","Feijão","Tapioca","Pão"])
print(itens1)
print()
print(itens2)

Arroz      2
Feijão     3
Queijo     6
Tapioca    4
dtype: int64

Queijo     9
Feijão     1
Tapioca    7
Pão        3
dtype: int64

__Caso não encontrado o indice é retornado "nan"__

In [14]:
itens1+itens2

Arroz       NaN
Feijão      4.0
Pão         NaN
Queijo     15.0
Tapioca    11.0
dtype: float64

<h3 align="left" style="color:blue" >
   Criando Dataframes
<h3>
<hr align="left" width="200px">

In [17]:
df = pd.DataFrame(data = np.arange(1,25).reshape(6,4), index = 'P A N D A S'.split(), columns =['A','B','C','D'] )
df

    A   B   C   D
P   1   2   3   4
A   5   6   7   8
N   9  10  11  12
D  13  14  15  16
A  17  18  19  20
S  21  22  23  24

__Quando um dicionanrio é utilizado nesse caso as chaves tornam - se colunas__

In [19]:
Dict = { "X" :[0.1,3.2,4.5], "Y" :[2.4,5.6,2.2]}

In [20]:
df = pd.DataFrame(data = Dict)
df

     X    Y
0  0.1  2.4
1  3.2  5.6
2  4.5  2.2

<h3 align="left" style="color:blue" >
   Operações
<h3>
<hr align="left" width="200px">

In [21]:
df = pd.DataFrame({'col1': [4,3,2,1,0],'col2': [278,999,555,278,555],'col3':['def','ghi','jkl','mno','abc']})
df

   col1  col2 col3
0     4   278  def
1     3   999  ghi
2     2   555  jkl
3     1   278  mno
4     0   555  abc

In [23]:
df['col2']

pandas.core.series.Series

In [24]:
#retorna uma lista que contém os valores da coluna sem repetição
df['col2'].unique()

array([278, 999, 555], dtype=int64)

In [25]:
df['col2'].nunique()

3

In [26]:
df['col2'].value_counts()

555    2
278    2
999    1
Name: col2, dtype: int64

In [27]:
df['col1'].sum()

10

In [31]:
df['col1'].max()

4

In [32]:
def vezes2(x):
    return x*2

In [33]:
df['col1'].apply(vezes2)

0    8
1    6
2    4
3    2
4    0
Name: col1, dtype: int64

In [34]:
df

   col1  col2 col3
0     4   278  def
1     3   999  ghi
2     2   555  jkl
3     1   278  mno
4     0   555  abc

In [35]:
df['col1'] = df['col1'].apply(vezes2)
df

   col1  col2 col3
0     8   278  def
1     6   999  ghi
2     4   555  jkl
3     2   278  mno
4     0   555  abc

In [36]:
df['col2'].apply(lambda x: x-100)

0    178
1    899
2    455
3    178
4    455
Name: col2, dtype: int64

In [39]:
df[['col1','col2']]

   col1  col2
0     8   278
1     6   999
2     4   555
3     2   278
4     0   555

In [40]:
df[['col1','col2']] < 70

   col1   col2
0  True  False
1  True  False
2  True  False
3  True  False
4  True  False

In [42]:
df

   col1  col2 col3
0     8   278  def
1     6   999  ghi
2     4   555  jkl
3     2   278  mno
4     0   555  abc

In [43]:
df['col1']<7

0    False
1     True
2     True
3     True
4     True
Name: col1, dtype: bool

In [41]:
df['col1'][df['col1']<7]

1    6
2    4
3    2
4    0
Name: col1, dtype: int64

In [44]:
df[df['col1']<7]

   col1  col2 col3
1     6   999  ghi
2     4   555  jkl
3     2   278  mno
4     0   555  abc

In [45]:
ex = pd.DataFrame({'temperatura': [25,20,20,19,28],'pluviosidade': [278,102,60,208,500],'dia':['segunda','terça','quarta','quinta','sexta']})
ex

   temperatura  pluviosidade      dia
0           25           278  segunda
1           20           102    terça
2           20            60   quarta
3           19           208   quinta
4           28           500    sexta

In [48]:
ex[ex['temperatura']<25]

   temperatura  pluviosidade     dia
1           20           102   terça
2           20            60  quarta
3           19           208  quinta

In [49]:
ex[(ex['temperatura'] < 25) & (ex['dia'] == 'quarta')]

   temperatura  pluviosidade     dia
2           20            60  quarta

In [50]:
ex[(ex['temperatura'] >= 25) | (ex['pluviosidade'] > 200)]

   temperatura  pluviosidade      dia
0           25           278  segunda
3           19           208   quinta
4           28           500    sexta

In [52]:
ex['HOJE'] = ['t','u','v','w','x']
ex

   temperatura  pluviosidade      dia new HOJE
0           25           278  segunda   t    t
1           20           102    terça   u    u
2           20            60   quarta   v    v
3           19           208   quinta   w    w
4           28           500    sexta   x    x

In [53]:
del(ex['new'])
ex

   temperatura  pluviosidade      dia HOJE
0           25           278  segunda    t
1           20           102    terça    u
2           20            60   quarta    v
3           19           208   quinta    w
4           28           500    sexta    x

In [54]:
df

   col1  col2 col3
0     8   278  def
1     6   999  ghi
2     4   555  jkl
3     2   278  mno
4     0   555  abc

In [55]:
df.sort_values(by='col2')

   col1  col2 col3
0     8   278  def
3     2   278  mno
2     4   555  jkl
4     0   555  abc
1     6   999  ghi

In [56]:
df.sort_values(by = 'col1')

   col1  col2 col3
4     0   555  abc
3     2   278  mno
2     4   555  jkl
1     6   999  ghi
0     8   278  def

In [57]:
df.sort_values(by = 'col3')

   col1  col2 col3
4     0   555  abc
0     8   278  def
1     6   999  ghi
2     4   555  jkl
3     2   278  mno

In [58]:
df.sort_values(by = 'col2', ascending = False)

   col1  col2 col3
1     6   999  ghi
2     4   555  jkl
4     0   555  abc
0     8   278  def
3     2   278  mno

In [60]:
df

   col1  col2 col3
0     8   278  def
1     6   999  ghi
2     4   555  jkl
3     2   278  mno
4     0   555  abc

In [59]:
df[df['col1']>2]

   col1  col2 col3
0     8   278  def
1     6   999  ghi
2     4   555  jkl

In [62]:
df['col1']>2

0     True
1     True
2     True
3    False
4    False
Name: col1, dtype: bool

In [65]:
df.where(df['col1']>2,other = 'não satisfeito')

             col1            col2            col3
0               8             278             def
1               6             999             ghi
2               4             555             jkl
3  não satisfeito  não satisfeito  não satisfeito
4  não satisfeito  não satisfeito  não satisfeito

In [67]:
df.mask(df['col1']>2, other = df['col1'].mean())

   col1  col2 col3
0     4     4  4.0
1     4     4  4.0
2     4     4  4.0
3     2   278  mno
4     0   555  abc

<h3 align="left" style="color:blue" >
   Dividindo os dados
<h3>
<hr align="left" width="200px">

In [121]:
names = ['Marcos','Tiago','Felipe','Rafael','Marcos','João','Tiago','Miguel','Marcos','Rafael','João','Felipe']

In [165]:
np.random.randint(3)

0

In [122]:
vendas = pd.DataFrame({"Responsável": names, "Valor": np.random.rand(12)*1000,"Data": ["2020-3-5","2020-3-12","2020-3-15","2020-3-7","2020-3-30","2020-3-26","2020-3-7","2020-3-19","2020-3-5","2020-3-19","2020-3-17","2020-3-14"]})
vendas

   Responsável       Valor       Data
0       Marcos  464.911059   2020-3-5
1        Tiago  144.139067  2020-3-12
2       Felipe  997.428164  2020-3-15
3       Rafael   49.288992   2020-3-7
4       Marcos  435.170618  2020-3-30
5         João  594.924071  2020-3-26
6        Tiago  249.883730   2020-3-7
7       Miguel  253.872389  2020-3-19
8       Marcos  608.841417   2020-3-5
9       Rafael  494.974975  2020-3-19
10        João  113.601874  2020-3-17
11      Felipe  128.922034  2020-3-14

In [123]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Responsável  12 non-null     object
 1   Valor        12 non-null     float64
 2   Data         12 non-null     object
dtypes: float64(1), object(2)
memory usage: 416.0+ bytes

In [134]:
vendas["Data"] = pd.to_datetime(vendas["Data"])
vendas["Responsável"] = vendas['Responsável'].convert_dtypes(convert_string=True)

In [135]:
vendas["Dia"] = vendas["Data"].dt.day_name()
vendas["Dia"] = vendas['Dia'].convert_dtypes(convert_string=True)

In [136]:
vendas

   Responsável       Valor       Data       Dia
0       Marcos  464.911059 2020-03-05  Thursday
1        Tiago  144.139067 2020-03-12  Thursday
2       Felipe  997.428164 2020-03-15    Sunday
3       Rafael   49.288992 2020-03-07  Saturday
4       Marcos  435.170618 2020-03-30    Monday
5         João  594.924071 2020-03-26  Thursday
6        Tiago  249.883730 2020-03-07  Saturday
7       Miguel  253.872389 2020-03-19  Thursday
8       Marcos  608.841417 2020-03-05  Thursday
9       Rafael  494.974975 2020-03-19  Thursday
10        João  113.601874 2020-03-17   Tuesday
11      Felipe  128.922034 2020-03-14  Saturday

In [137]:
vendas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Responsável  12 non-null     string
 1   Valor        12 non-null     float64
 2   Data         12 non-null     datetime64[ns]
 3   Dia          12 non-null     string
dtypes: datetime64[ns](1), float64(1), string(2)
memory usage: 512.0 bytes

In [139]:
#Uma linha inteira
vendas.iloc[0]

Responsável                 Marcos
Valor                   464.911059
Data           2020-03-05 00:00:00
Dia                       Thursday
Name: 0, dtype: object

In [142]:
vendas.iloc[0,0]

'Marcos'

In [146]:
#Uma coluna inteira
vendas.iloc[:,0]

0     Marcos
1      Tiago
2     Felipe
3     Rafael
4     Marcos
5       João
6      Tiago
7     Miguel
8     Marcos
9     Rafael
10      João
11    Felipe
Name: Responsável, dtype: string

In [147]:
vendas.iloc[:3,0]

0    Marcos
1     Tiago
2    Felipe
Name: Responsável, dtype: string

In [149]:
vendas.iloc[:3,:2]

  Responsável       Valor
0      Marcos  464.911059
1       Tiago  144.139067
2      Felipe  997.428164

In [153]:
vendas.iloc[0:5,2:]

        Data       Dia
0 2020-03-05  Thursday
1 2020-03-12  Thursday
2 2020-03-15    Sunday
3 2020-03-07  Saturday
4 2020-03-30    Monday

In [154]:
vendas.iloc[[1,5,6],[0,3]]

  Responsável       Dia
1       Tiago  Thursday
5        João  Thursday
6       Tiago  Saturday

In [55]:
vendas.loc[0]

Responsável                 Marcos
Valor                   836.718944
Data           2020-03-05 00:00:00
Dia                       Thursday
Name: 0, dtype: object

In [155]:
vendas.loc[2,"Valor":]

Valor             997.428164
Data     2020-03-15 00:00:00
Dia                   Sunday
Name: 2, dtype: object

<h3 align="left" style="color:blue" >
   Método Groupby()
<h3>
<hr align="left" width="200px">
    
__Esse metodo permite agupar os dados segundo o parâmetro colocado e em seguida realizar algumas operações__

In [157]:
vendas.groupby(vendas['Dia'])

In [158]:
vendas.groupby(vendas['Dia']).sum()

                Valor
Dia
Monday     435.170618
Saturday   428.094756
Sunday     997.428164
Thursday  2561.662978
Tuesday    113.601874

In [110]:
vendas.groupby(vendas['Responsável']).sum()

                   Valor
Responsável
Felipe        890.287728
João         1773.271938
Marcos       1978.921174
Miguel        712.459048
Rafael       1028.142666
Tiago         795.944565

In [118]:
vendas.groupby(vendas['Responsável']).describe()

            Valor                                                              \
            count        mean         std         min         25%         50%
Responsável
Felipe        2.0  445.143864   92.208492  379.942614  412.543239  445.143864
João          2.0  886.635969  110.294684  808.645850  847.640910  886.635969
Marcos        3.0  659.640391  407.114341  192.248339  520.994511  849.740683
Miguel        1.0  712.459048         NaN  712.459048  712.459048  712.459048
Rafael        2.0  514.071333  252.356579  335.628285  424.849809  514.071333
Tiago         2.0  397.972282  139.116112  299.602336  348.787309  397.972282


                    75%         max
Responsável
Felipe       477.744489  510.345114
João         925.631029  964.626088
Marcos       893.336418  936.932153
Miguel       712.459048  712.459048
Rafael       603.292857  692.514381
Tiago        447.157255  496.342228

In [156]:
vendas['Data'].dt.day

0      5
1     12
2     15
3      7
4     30
5     26
6      7
7     19
8      5
9     19
10    17
11    14
Name: Data, dtype: int64

In [107]:
vendas.groupby(vendas['Data'].dt.day)

In [120]:
vendas.groupby(vendas['Data'].dt.day).sum()

            Valor
Data
5     1129.180491
7      992.116717
12     496.342228
14     379.942614
15     510.345114
17     964.626088
19    1048.087333
26     808.645850
30     849.740683

<h3 align="left" style="color:blue" >
   Lidando com dados ausentes
<h3>
<hr align="left" width="200px">

In [167]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [112]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [113]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [168]:
df.dropna(axis = 1,thresh = 2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [169]:
df.fillna(value='vazio')

       A      B  C
0    1.0    5.0  1
1    2.0  vazio  2
2  vazio  vazio  3

In [170]:
df.fillna(value = df['C'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

<h3 align="left" style="color:blue" >
   Combinando Dataframes
<h3>
<hr align="left" width="200px">

* Merge
* Join 
* Concat

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

In [ ]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

### __Concatenar__
- Une os dataframes um abaixo do outro ou a direita do outro, para isso é importante que o número de colunas e/ou linhas sejam iguais

In [ ]:
pd.concat([df1,df2,df3])

In [ ]:
pd.concat([df1,df2,df3],axis = 1)

In [ ]:
df2.reset_index(drop = True)

In [ ]:
pd.concat([df1,df2.reset_index(drop = True),df3.reset_index(drop = True)],axis = 1)

### __Mesclar__
- Esse método te permite unir 2 dataframes apartir de algo em comun.

In [ ]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
esquerda

In [ ]:
direita

In [ ]:
pd.merge(esquerda,direita,on='key')

In [ ]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
esquerda

In [ ]:
direita

In [ ]:
pd.merge(esquerda, direita, on=['key1', 'key2'])

### __Juntar__
- Esse método te permite unir dataframes com segundo os indices

In [ ]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
esquerda

In [ ]:
direita

A partir do índices da esquerda une os valores de direita com os indices correspondentes

In [ ]:
esquerda.join(direita)

Com o parametro 'outer' o join usa todos os indices encontrados em ambos os dataframes e preenche de acordo

In [ ]:
esquerda.join(direita, how='outer')

<h3 align="left" style="color:blue" >
   Ler e exportar dados tabulados
<h3>
<hr align="left" width="200px">

o método "read_" permite que importemos dados de diversos tipos
https://pandas.pydata.org/pandas-docs/stable/search.html?q=pandas.read_

### _Csv_

In [1]:
# o mais comun dos tipos de estruturação de dados usado é o csv (comma separate values)
import os
print(os.getcwd())
exemplo_csv =pd.read_csv('C:/Users/manu_/OneDrive/Documentos/Faculdade/Projetos/PET/intro_a_manipulacao_de_dados_com_python/datasets/Exemplo-csv.csv',index_col = 0,sep = ',', header = 0)
exemplo_csv

C:\Users\manu_

NameError: name 'pd' is not defined

In [185]:
exemplo_csv.to_csv('exemplo_csv',sep = ';')

### _Excel_

In [186]:
exemplo_excel = pd.read_excel('C:/Users/manu_/OneDrive/Documentos/Faculdade/Projetos/PET/intro_a_manipulacao_de_dados_com_python/datasets/Exemplo-Excel.xlsx',index_col= 0)
exemplo_excel

         0       1          2         3
A    Alice   Anita        Ana    Arthur
B  Beatriz   Bruno     Bianca  Benjamin
C     Caio  Camila    Cecilia  Catarina
D   Daniel    Davi  Dominique  Doralice

In [187]:
exemplo_excel.to_excel('exemplo.xlsx')

### _HTML_

In [188]:
import html5lib
import lxml
from bs4 import BeautifulSoup

In [194]:
exemplo_html = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
exemplo_html

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [190]:
type(exemplo_html)

list

In [191]:
len(exemplo_html)

1

In [197]:
exemplo_html[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [193]:
exemplo_html[0].to_html('exemplo.html')

<h1 align="left" style="color:blue" >
   FIM 
<h1>

<div>
    <a href="https://www.ufpb.br/">
        <img src="../images/logo_ufpb.png" align="left" height="50px" width="70px">
    </a>
    <a href="http://www.cear.ufpb.br/">
        <img src="../images/logo_cear.png" align="left" width="95px">
    </a>
</div>